Catalogs/тсВидыПечатныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>тсВидыПечатныхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СклеиватьВОдинФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьПослеФормирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОднаИсходящаяКорреспонденция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныПечатныхФорм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонПечатнойФормы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.тсВидыПечатныхДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.тсШаблоныПечатныхДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.КомплектыФайловДляПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияКоличество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийНомер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прикреплять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИсходящаяКорреспонденция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИсходящаяКорреспонденция</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗакреплен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонверта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесРПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрикрепленныйФайл</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикрепитьФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодобранныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикрепитьФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПечатьЭлектронныхДокументовСервер/Ext/Module.bsl
Функция СформироватьСклеиныйТекст(Знач Буфер, ИмяФайла, Номер = "") Экспорт

	ПереместитьФайл(
		ИмяФайла + ШаблоныДокументовСервер.ФорматУниверсальногоФайла(),
		ИмяФайла + ШаблоныДокументовСервер.ФорматZIPФайла());
	
	ЧтениеZIP = Новый ЧтениеZipФайла(ИмяФайла + ШаблоныДокументовСервер.ФорматZIPФайла(), "");
	СоздатьКаталог(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(ИмяФайла);
	ПутьXML = ИмяФайла + ПолучитьРазделительПути();
	ПутьXML = ШаблоныДокументовСервер.ИмяФайлаССодержимымВАрхивеDOCX(ПутьXML);
	
	ЧтениеФайла = Новый ТекстовыйДокумент;
	ЧтениеФайла.Прочитать(ПутьXML);
	ТекстXML = ЧтениеФайла.ПолучитьТекст();
	
	НовыйТекст = Буфер;
	НачалоBody = 1;
	Если ЗначениеЗаполнено(НовыйТекст) Тогда
	
		НачалоBody = СтрНайти(ТекстXML, "<w:body>");
	
	КонецЕсли;
	КонецBody = СтрНайти(ТекстXML, "</w:body>", НаправлениеПоиска.СКонца);
	ДнинаКонецBody = 9;
	
	Если Номер <> "Первый" Тогда
	
		НовыйТекст = НовыйТекст + ТекстНовойСтроки();
	
	КонецЕсли;
	Если НачалоBody <> 0 И КонецBody <> 0 Тогда
	
		НовыйТекст = НовыйТекст + Сред(ТекстXML, НачалоBody, КонецBody - НачалоBody + ДнинаКонецBody + 1);
	
	КонецЕсли;
	
	Если Номер = "Последний" Тогда
	
		НовыйТекст = НовыйТекст + Прав(ТекстXML, СтрДлина(ТекстXML) - КонецBody - ДнинаКонецBody);
	
	КонецЕсли;
	
	Возврат НовыйТекст;

КонецФункции

Функция ЗаписатьСклеенныйФайл(Буфер, ИмяФайла, Номер) Экспорт

	ПереместитьФайл(
		ИмяФайла + ШаблоныДокументовСервер.ФорматУниверсальногоФайла(),
		ИмяФайла + ШаблоныДокументовСервер.ФорматZIPФайла());
	
	ЧтениеZIP = Новый ЧтениеZipФайла(ИмяФайла + ШаблоныДокументовСервер.ФорматZIPФайла(), "");
	СоздатьКаталог(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(ИмяФайла);
	ПутьXML = ИмяФайла + ПолучитьРазделительПути();
	ПутьXML = ПутьXML + "word" + ПолучитьРазделительПути() + "document.xml";
	
	ЧтениеФайла = Новый ТекстовыйДокумент;
	ЧтениеФайла.Прочитать(ПутьXML);
	ТекстXML = ЧтениеФайла.ПолучитьТекст();
	
	НовыйТекст = Буфер;
	НачалоBody = 1;
	Если ЗначениеЗаполнено(НовыйТекст) Тогда
	
		НачалоBody = СтрНайти(ТекстXML, "<w:body>");
	
	КонецЕсли;
	КонецBody = СтрНайти(ТекстXML, "</w:body>", НаправлениеПоиска.СКонца);
	ДнинаКонецBody = 9;
	
	Если Номер <> "Первый" Тогда
	
		НовыйТекст = НовыйТекст + ТекстНовойСтроки();
	
	КонецЕсли;
	Если НачалоBody <> 0 И КонецBody <> 0 Тогда
	
		НовыйТекст = НовыйТекст + Сред(ТекстXML, НачалоBody, КонецBody - НачалоBody + ДнинаКонецBody + 1);
	
	КонецЕсли;
	
	Если Номер = "Последний" Тогда
	
		НовыйТекст = НовыйТекст + Прав(ТекстXML, СтрДлина(ТекстXML) - КонецBody - ДнинаКонецBody);
	
	КонецЕсли;
	
	Возврат НовыйТекст;

КонецФункции

Функция ОднаИсходящаяКорреспонденция(НаборШаблонов) Экспорт

	Возврат НаборШаблонов.ОднаИсходящаяКорреспонденция;

КонецФункции // ()

Функция ОбъектыПоНазначению(Объекты, Шаблон) Экспорт

	Если Объекты.Количество() = 0 Тогда
	
		Возврат Объекты;
	
	КонецЕсли;

	Назначение = Шаблон.Назначение;
	ТипНазначения = УЭДСервер.ПолучитьТипИзСтроки(Назначение);
	Если ТипЗнч(Объекты[0]) = ТипНазначения Тогда
	
		Возврат Объекты;
	
	КонецЕсли;
	
	Если ТипЗнч(Объекты[0]) <> Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
	
		ВызватьИсключение "Конвертация объектов производится только из Долговых обязательств"
						+ Символы.ПС + "Используемый тип: " + ТипЗнч(Объекты[0]);
	
	КонецЕсли;
	
	Возврат Справочники.тсВидыПечатныхДокументов.ОбъектыПоНазначению(
		Объекты,
		ТипНазначения
	);

КонецФункции // ()

Функция ТекстНовойСтроки()

	Возврат "<w:p w:rsidRDefault=""005874EA"" w:rsidR=""005874EA""><w:r><w:br w:type=""page""/></w:r></w:p>";

КонецФункции // ()

Функция НачатьИсходящуюКорреспонденцию(Шаблон, ДанныеРегистрации)

	ОбъектИсходящаяКорреспонденция = Справочники.ИсходящаяКорреспонденция.СоздатьЭлементПоШаблонуПечатнойФормы(Шаблон);
	ОбъектИсходящаяКорреспонденция.Объект = ДанныеРегистрации["Основание"];;
	
	Возврат ОбъектИсходящаяКорреспонденция;

КонецФункции // ()

Функция ЗарегистрироватьИсходящуюКорреспонденцию(ОбъектИсходящаяКорреспонденция, Шаблон, ДанныеРегистрации)

	Результат = ОбъектИсходящаяКорреспонденция.Зарегестрировать(Шаблон, ДанныеРегистрации);
	Если Результат Тогда
	
		ОбъектИсходящаяКорреспонденция.Записать();
	
	КонецЕсли;
	
	Возврат ОбъектИсходящаяКорреспонденция;

КонецФункции // ()

Функция ДобавитьФайлВИсходящуюКорреспонденцию(ОбъектИсходящаяКорреспонденция, Шаблон, ДанныеРегистрации)

	Результат = ОбъектИсходящаяКорреспонденция.ДобавитьФайл(Шаблон, ДанныеРегистрации);
	Если Результат Тогда
	
		ОбъектИсходящаяКорреспонденция.Записать();
	
	КонецЕсли;
	
	Возврат ОбъектИсходящаяКорреспонденция;

КонецФункции // ()

// НаборДокументов -- Массив - Комплект шаблонов по основанию
//  Комплект -- Массив - Свойства шаблона
//    ИсходящаяКомплектом -- Булево - Регистрация шаблонов одной корреспонденцией\раздельно
//    Основание -- СправочникСсылка.(ДолговыеОбязательства, Контрагенты ...) - Объект на основании которого формировался шаблон
//    Документ -- ДокументСсылка.ПрикреплениеФайлов
//    Настройки -- Структура - Детальные данные шаблона
//      ИсходящийНомер - Булево - Требуется ли прикреплять данный шаблон
//      ШаблонПечатнойФормы -- СправочникСсылка.тсШаблоныПечатныхФорм
//      РегистрационныйНомер -- Строка
//      ДатаРегистрации -- Дата
Процедура СоздатьИсходящуюКорреспонденцию(НаборДокументов) Экспорт

	Для каждого Комплект Из НаборДокументов Цикл
	
		ОбъектИсходящаяКорреспонденция = Неопределено;
		
		Для каждого СвойстваШаблона Из Комплект Цикл
		
			Если НЕ СвойстваШаблона["ИсходящаяКомплектом"] Тогда
			
				ОбъектИсходящаяКорреспонденция = Неопределено;
			
			КонецЕсли;
			
			ОбъектИсходящаяКорреспонденция = СформироватьИсходящуюКорреспонденцию(ОбъектИсходящаяКорреспонденция, СвойстваШаблона);
		
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры

Функция СформироватьИсходящуюКорреспонденцию(ОбъектИсходящаяКорреспонденция, СвойстваШаблона)

	ДанныеШаблона = СвойстваШаблона["Настройки"];
	Если НЕ ДанныеШаблона["ИсходящийНомер"] Тогда
	
		Возврат ОбъектИсходящаяКорреспонденция;
	
	КонецЕсли;
	
	Шаблон = ДанныеШаблона["ШаблонПечатнойФормы"];
	
	ДанныеРегистрации = Новый Структура;
	ДанныеРегистрации.Вставить("Номер", ДанныеШаблона["РегистрационныйНомер"]);
	ДанныеРегистрации.Вставить("Дата", ДанныеШаблона["ДатаРегистрации"]);
	ДанныеРегистрации.Вставить("Основание", СвойстваШаблона["Основание"]);
	ДанныеРегистрации.Вставить("ДокументПрикрепление", СвойстваШаблона["Документ"]);
	
	Если ОбъектИсходящаяКорреспонденция = Неопределено Тогда
	
		ОбъектИсходящаяКорреспонденция = НачатьИсходящуюКорреспонденцию(Шаблон, ДанныеРегистрации);
		ОбъектИсходящаяКорреспонденция = ЗарегистрироватьИсходящуюКорреспонденцию(ОбъектИсходящаяКорреспонденция, Шаблон, ДанныеРегистрации);
	
	КонецЕсли;
	
	Возврат ДобавитьФайлВИсходящуюКорреспонденцию(ОбъектИсходящаяКорреспонденция, Шаблон, ДанныеРегистрации);

КонецФункции // ()

Функция РегистрационныйНомерКомплекта(Основание, ПечатнаяФорма) Экспорт

	Если НЕ ПечатнаяФорма.ОднаИсходящаяКорреспонденция Тогда
	
		Возврат Неопределено;
	
	КонецЕсли;
	
	Шаблоны = ПечатнаяФорма.ШаблоныПечатныхФорм;
	Если Шаблоны.Количество() = 0 Тогда
	
		Возврат Неопределено;
	
	КонецЕсли;
	
	ТипПисьма = Неопределено;
	Для каждого Шаблон Из Шаблоны Цикл
	
		Если Шаблон.ШаблонПечатнойФормы.Пустая() Тогда
		
			Возврат Неопределено;
		
		КонецЕсли;
		Если НЕ Шаблон.ИсходящийНомер Тогда
		
			Продолжить;
		
		КонецЕсли;

		ТипПисьма = Шаблон.ШаблонПечатнойФормы.ТипПисьма;
		Прервать;
	
	КонецЦикла;
	
	РегистрационныйНомер = РегистрацияКорреспонденции.СледующийНомер(
		ТипПисьма,
		Основание);
	
	Возврат РегистрационныйНомер;

КонецФункции // ()
